INSERT INTO `violations` (`ID`, `Type`, `Fine`, `Warning`, `PeriodOfDisqualification`) VALUES
	(1, 'Превышение скорости', 500.00, 'Да', NULL),
	(2, 'Езда в нетрезвом виде', 1500.00, 'Да', '12-36 месяцев'),
	(3, 'Непристегнутый ремень', 500.00, 'Да', NULL);


INSERT INTO `drivers` (`DrivingLicense`, `FullName`, `Address`, `Phone`) VALUES
	(1, 'Кутаяков Дмитрий Арманович', 'Агаповка, Школьная 88/2', '89507361975'),
	(2, 'Иванов Иван Денисович', 'Агаповка, Рабочая 68', '89894562378'),
	(3, 'Петров Петр Петрович', 'Магнитогорск, Карла Маркса 167/3', '85045678125'),
	(4, 'Сидорова Анна Николаевна', 'Магнитогорск, Индустриальная 6', '89832321654');


INSERT INTO `cars` (`Number`, `Driver`, `Mark`, `Model`, `Color`, `Release`, `RegistrationDate`) VALUES
	('А204ВА', 1, 'Лада', 'ВАЗ 2114', 'Черный', '2004', '2019-05-25'),
	('Е345НК', 2, 'BMW', 'X6', 'Синий', '2017', '2018-06-09'),
	('П503АТ', 3, 'Audi', 'TT', 'Красный', '2016', '2021-11-03');


INSERT INTO `recoveries` (`ViolationID`, `DateOfViolation`, `DrivingLicense`, `Location`, `Fine`, `Paid`, `PeriodOfDisqualification`, `BaseValue`, `InspectorID`) VALUES
	(1, '2022-02-10 11:30:27', 3, 'Магнитогорск, Карла Марса 181', 500.00, 'Да', NULL, 500.00, 1),
	(2, '2021-12-30 23:48:33', 1, 'Агаповка, Школьная 55', 1500.00, 'Нет', NULL, 1500.00, 2),
	(3, '2022-02-05 11:32:32', 2, 'Агоповка, Пролетарская 66', 500.00, 'Да', NULL, 500.00, 2);